## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 95 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         RESOURCE                                         |
|--------|------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.n8n`                                                                |
|        | `aws_acm_certificate_validation.n8n`                                                     |
|        | `aws_cloudwatch_log_metric_filter.n8n_ecs_errors`                                        |
|        | `aws_cloudwatch_metric_alarm.n8n_ecs_errors`                                             |
|        | `aws_cloudwatch_metric_alarm.n8n_ecs_high_cpu`                                           |
|        | `aws_cloudwatch_metric_alarm.n8n_ecs_high_memory`                                        |
|        | `aws_cloudwatch_metric_alarm.n8n_load_balancer_healthy_hosts`                            |
|        | `aws_cloudwatch_metric_alarm.n8n_load_balancer_response_time`                            |
|        | `aws_cloudwatch_metric_alarm.n8n_load_balancer_unhealthy_hosts`                          |
|        | `aws_cloudwatch_query_definition.n8n_ecs_errors`                                         |
|        | `aws_efs_access_point.n8n`                                                               |
|        | `aws_efs_backup_policy.n8n`                                                              |
|        | `aws_efs_file_system.n8n`                                                                |
|        | `aws_efs_file_system_policy.n8n`                                                         |
|        | `aws_efs_mount_target.n8n[0]`                                                            |
|        | `aws_efs_mount_target.n8n[1]`                                                            |
|        | `aws_iam_role.n8n_waf_logs`                                                              |
|        | `aws_iam_role_policy.n8n_waf_logs`                                                       |
|        | `aws_kinesis_firehose_delivery_stream.n8n_waf_logs`                                      |
|        | `aws_kms_key.cloudwatch_alerts`                                                          |
|        | `aws_lb.n8n`                                                                             |
|        | `aws_lb_listener.n8n`                                                                    |
|        | `aws_lb_target_group.n8n`                                                                |
|        | `aws_route53_record.n8n_A`                                                               |
|        | `aws_route53_record.n8n_validation[&quot;*.n8n.cdssandbox.xyz&quot;]`                              |
|        | `aws_route53_record.n8n_validation[&quot;n8n.cdssandbox.xyz&quot;]`                                |
|        | `aws_security_group.n8n_ecs`                                                             |
|        | `aws_security_group.n8n_efs`                                                             |
|        | `aws_security_group.n8n_lb`                                                              |
|        | `aws_security_group_rule.n8n_ecs_egress_all`                                             |
|        | `aws_security_group_rule.n8n_ecs_ingress_lb`                                             |
|        | `aws_security_group_rule.n8n_efs_ingress_ecs`                                            |
|        | `aws_security_group_rule.n8n_lb_egress_ecs`                                              |
|        | `aws_security_group_rule.n8n_lb_ingress_internet_https`                                  |
|        | `aws_shield_application_layer_automatic_response.n8n_alb`                                |
|        | `aws_shield_protection.n8n_alb`                                                          |
|        | `aws_shield_protection.n8n_route53`                                                      |
|        | `aws_shield_subscription.n8n`                                                            |
|        | `aws_sns_topic.cloudwatch_alert_ok`                                                      |
|        | `aws_sns_topic.cloudwatch_alert_warning`                                                 |
|        | `aws_sns_topic_policy.cloudwatch_alert_ok`                                               |
|        | `aws_sns_topic_policy.cloudwatch_alert_warning`                                          |
|        | `aws_sns_topic_subscription.cloudwatch_alert_ok`                                         |
|        | `aws_sns_topic_subscription.cloudwatch_alert_warning`                                    |
|        | `aws_ssm_parameter.n8n_encryption_key`                                                   |
|        | `aws_wafv2_web_acl.n8n`                                                                  |
|        | `aws_wafv2_web_acl_association.n8n`                                                      |
|        | `aws_wafv2_web_acl_logging_configuration.n8n_waf_logs`                                   |
|        | `random_string.alb_tg_suffix`                                                            |
|        | `module.n8n_ecs.aws_cloudwatch_log_group.this`                                           |
|        | `module.n8n_ecs.aws_ecs_cluster.this[0]`                                                 |
|        | `module.n8n_ecs.aws_ecs_cluster_capacity_providers.this[0]`                              |
|        | `module.n8n_ecs.aws_ecs_service.this`                                                    |
|        | `module.n8n_ecs.aws_ecs_task_definition.this`                                            |
|        | `module.n8n_ecs.aws_iam_policy.this_task[0]`                                             |
|        | `module.n8n_ecs.aws_iam_policy.this_task_exec`                                           |
|        | `module.n8n_ecs.aws_iam_role.this_task`                                                  |
|        | `module.n8n_ecs.aws_iam_role.this_task_exec`                                             |
|        | `module.n8n_ecs.aws_iam_role_policy_attachment.this_task[0]`                             |
|        | `module.n8n_ecs.aws_iam_role_policy_attachment.this_task_exec`                           |
|        | `module.vpc.aws_cloudwatch_log_group.flow_logs[0]`                                       |
|        | `module.vpc.aws_default_network_acl.default`                                             |
|        | `module.vpc.aws_default_route_table.default`                                             |
|        | `module.vpc.aws_default_security_group.default`                                          |
|        | `module.vpc.aws_eip.nat[0]`                                                              |
|        | `module.vpc.aws_flow_log.flow_logs[0]`                                                   |
|        | `module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]`                        |
|        | `module.vpc.aws_iam_role.flow_logs[0]`                                                   |
|        | `module.vpc.aws_iam_role_policy_attachment.vpc_metrics_flow_logs_write_policy_attach[0]` |
|        | `module.vpc.aws_internet_gateway.gw`                                                     |
|        | `module.vpc.aws_nat_gateway.nat_gw[0]`                                                   |
|        | `module.vpc.aws_network_acl.main`                                                        |
|        | `module.vpc.aws_network_acl_rule.block_rdp[0]`                                           |
|        | `module.vpc.aws_network_acl_rule.block_ssh[0]`                                           |
|        | `module.vpc.aws_network_acl_rule.https_request_egress_443[0]`                            |
|        | `module.vpc.aws_network_acl_rule.https_request_in_ingress_443[0]`                        |
|        | `module.vpc.aws_network_acl_rule.https_request_in_ingress_ephemeral[0]`                  |
|        | `module.vpc.aws_network_acl_rule.https_request_in_response_egress_443[0]`                |
|        | `module.vpc.aws_network_acl_rule.https_request_in_response_egress_ephemeral[0]`          |
|        | `module.vpc.aws_network_acl_rule.https_request_out_egress_ephemeral[0]`                  |
|        | `module.vpc.aws_network_acl_rule.https_request_out_response_ingress_443[0]`              |
|        | `module.vpc.aws_network_acl_rule.https_request_out_response_ingress_ephemeral[0]`        |
|        | `module.vpc.aws_route.private_nat_gateway[0]`                                            |
|        | `module.vpc.aws_route.public_internet_gateway`                                           |
|        | `module.vpc.aws_route_table.private[0]`                                                  |
|        | `module.vpc.aws_route_table.public`                                                      |
|        | `module.vpc.aws_route_table_association.private[0]`                                      |
|        | `module.vpc.aws_route_table_association.private[1]`                                      |
|        | `module.vpc.aws_route_table_association.public[0]`                                       |
|        | `module.vpc.aws_route_table_association.public[1]`                                       |
|        | `module.vpc.aws_subnet.private[0]`                                                       |
|        | `module.vpc.aws_subnet.private[1]`                                                       |
|        | `module.vpc.aws_subnet.public[0]`                                                        |
|        | `module.vpc.aws_subnet.public[1]`                                                        |
|        | `module.vpc.aws_vpc.main`                                                                |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/cds-n8n/actions/runs/15761808368).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ecs_task_ssm_parameters will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ecs_task_ssm_parameters" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetSSMParameters"
        }
    }

  # data.aws_iam_policy_document.efs_access_point_secure will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_access_point_secure" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowAccessThroughAccessPoint"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "elasticfilesystem:AccessPointArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "DenyNonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.efs_mount will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "efs_mount" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientWrite",
              + "elasticfilesystem:DescribeMountTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_acm_certificate.n8n will be created
  + resource "aws_acm_certificate" "n8n" {
      + arn                       = (known after apply)
      + domain_name               = "n8n.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.n8n.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "n8n.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.n8n.cdssandbox.xyz",
          + "n8n.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.n8n will be created
  + resource "aws_acm_certificate_validation" "n8n" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.n8n_ecs_errors will be created
  + resource "aws_cloudwatch_log_metric_filter" "n8n_ecs_errors" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/n8n/n8n"
      + name           = "n8n-error"
      + pattern        = "[(w1=\"*ERROR*\" || w1=\"*Error*\" || w1=\"*error*\" || w1=\"*Exception*\" || w1=\"*exception*\")]"

      + metric_transformation {
          + default_value = "0"
          + name          = "n8n-error"
          + namespace     = "n8n"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.n8n_ecs_errors will be created
  + resource "aws_cloudwatch_metric_alarm" "n8n_ecs_errors" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "n8n errors logged over 1 minute."
      + alarm_name                            = "n8n-errors"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "n8n-error"
      + namespace                             = "n8n"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.n8n_ecs_high_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "n8n_ecs_high_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "High CPU use over 5 minutes."
      + alarm_name                            = "ecs-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "n8n"
          + "ServiceName" = "n8n"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.n8n_ecs_high_memory will be created
  + resource "aws_cloudwatch_metric_alarm" "n8n_ecs_high_memory" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "High memory use over 5 minutes."
      + alarm_name                            = "ecs-high-memory"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "n8n"
          + "ServiceName" = "n8n"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 50
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.n8n_load_balancer_healthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "n8n_load_balancer_healthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "There are no healthy hosts for the n8n load balancer in a 1 minute period."
      + alarm_name                            = "load-balancer-healthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.n8n_load_balancer_response_time will be created
  + resource "aws_cloudwatch_metric_alarm" "n8n_load_balancer_response_time" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Response time for the n8n load balancer is consistently over 3 seconds over 5 minutes."
      + alarm_name                            = "load-balancer-response-time"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + datapoints_to_alarm                   = 4
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 5
      + id                                    = (known after apply)
      + ok_actions                            = (known after apply)
      + tags                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 3
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "response_time"
          + return_data = true
            # (3 unchanged attributes hidden)

          + metric {
              + dimensions  = (known after apply)
              + metric_name = "TargetResponseTime"
              + namespace   = "AWS/ApplicationELB"
              + period      = 60
              + stat        = "Average"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_cloudwatch_metric_alarm.n8n_load_balancer_unhealthy_hosts will be created
  + resource "aws_cloudwatch_metric_alarm" "n8n_load_balancer_unhealthy_hosts" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "There are unhealthy n8n load balancer hosts in a 1 minute period."
      + alarm_name                            = "load-balancer-unhealthy-hosts"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Maximum"
      + tags                                  = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                              = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.n8n_ecs_errors will be created
  + resource "aws_cloudwatch_query_definition" "n8n_ecs_errors" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/ecs/n8n/n8n",
        ]
      + name                = "n8n - errors"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /ERROR|Error|error|Exception|exception/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_efs_access_point.n8n will be created
  + resource "aws_efs_access_point" "n8n" {
      + arn             = (known after apply)
      + file_system_arn = (known after apply)
      + file_system_id  = (known after apply)
      + id              = (known after apply)
      + owner_id        = (known after apply)
      + tags            = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all        = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }

      + posix_user {
          + gid = 1000
          + uid = 1000
        }

      + root_directory {
          + path = "/n8n"

          + creation_info {
              + owner_gid   = 1000
              + owner_uid   = 1000
              + permissions = "775"
            }
        }
    }

  # aws_efs_backup_policy.n8n will be created
  + resource "aws_efs_backup_policy" "n8n" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "ENABLED"
        }
    }

  # aws_efs_file_system.n8n will be created
  + resource "aws_efs_file_system" "n8n" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = (known after apply)
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = (known after apply)
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + throughput_mode         = "bursting"

      + protection (known after apply)
    }

  # aws_efs_file_system_policy.n8n will be created
  + resource "aws_efs_file_system_policy" "n8n" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_efs_mount_target.n8n[0] will be created
  + resource "aws_efs_mount_target" "n8n" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_efs_mount_target.n8n[1] will be created
  + resource "aws_efs_mount_target" "n8n" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = (known after apply)
    }

  # aws_iam_role.n8n_waf_logs will be created
  + resource "aws_iam_role" "n8n_waf_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "n8n-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.n8n_waf_logs will be created
  + resource "aws_iam_role_policy" "n8n_waf_logs" {
      + id          = (known after apply)
      + name        = "n8n-waf-logs"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cbs-satellite-517451398792/*",
                          + "arn:aws:s3:::cbs-satellite-517451398792",
                        ]
                    },
                  + {
                      + Action   = "iam:CreateServiceLinkedRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_kinesis_firehose_delivery_stream.n8n_waf_logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "n8n_waf_logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-n8n"
      + tags_all       = (known after apply)
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-517451398792"
          + buffering_interval = 300
          + buffering_size     = 5
          + compression_format = "GZIP"
          + custom_time_zone   = "UTC"
          + prefix             = "waf_acl_logs/AWSLogs/517451398792/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options (known after apply)
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_kms_key.cloudwatch_alerts will be created
  + resource "aws_kms_key" "cloudwatch_alerts" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "SNS topic for CloudWatch alarm alerts"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::517451398792:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "logs.us-east-1.amazonaws.com",
                              + "logs.ca-central-1.amazonaws.com",
                            ]
                        }
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow_CloudWatch_for_CMK"
                    },
                  + {
                      + Action    = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:Describe*",
                          + "kms:Decrypt*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "CloudwatchEvents"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_lb.n8n will be created
  + resource "aws_lb" "n8n" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "n8n-staging"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + tags_all                                                     = {
          + "CostCentre" = "n8n-staging"
          + "Terraform"  = "true"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = "cbs-satellite-517451398792"
          + enabled = true
          + prefix  = "lb_logs"
        }

      + subnet_mapping (known after apply)
    }

  # aws_lb_listener.n8n will be created
  + resource "aws_lb_listener" "n8n" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.n8n_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.n8n_waf_logs"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
